[
    {
      "id": "squat-basic",
      "name": "Basic Squat",
      "muscleGroups": ["Quads", "Glutes", "Hamstrings", "Core"],
      "equipment": ["none"],
      "difficulty": "beginner",
      "imageUrl": "/images/exercises/squat-basic.jpg",
      "shortDescription": "A fundamental lower body exercise that targets multiple muscle groups.",
      "instructions": "Stand with feet shoulder-width apart. Keep your chest up and back straight as you bend your knees and lower your body as if sitting in a chair. Go as low as comfortable, ideally until thighs are parallel with the floor. Push through your heels to return to starting position.",
      "tips": [
        "Keep your knees in line with your toes",
        "Maintain a neutral spine throughout the movement",
        "Engage your core for stability",
        "Push through your heels when rising"
      ],
      "suggestedWeight": "Body weight",
      "defaultSets": 3,
      "defaultReps": 12,
      "restPeriod": 60,
      "category": "compound",
      "goalSupport": ["strength", "muscle", "weight-loss", "endurance"]
    },
    {
      "id": "push-up-standard",
      "name": "Standard Push-Up",
      "muscleGroups": ["Chest", "Triceps", "Shoulders", "Core"],
      "equipment": ["none"],
      "difficulty": "beginner",
      "imageUrl": "/images/exercises/push-up-standard.jpg",
      "shortDescription": "Classic upper body exercise that builds pushing strength and stability.",
      "instructions": "Start in a plank position with hands slightly wider than shoulder-width apart. Keep your body in a straight line from head to heels. Lower your body by bending your elbows until your chest nearly touches the floor. Push yourself back up to the starting position by fully extending your arms.",
      "tips": [
        "Keep your core engaged throughout the movement",
        "Don't let your hips sag or pike up",
        "Position your hands at chest level",
        "For an easier variation, perform on knees instead of toes"
      ],
      "suggestedWeight": "Body weight",
      "defaultSets": 3,
      "defaultReps": 10,
      "restPeriod": 60,
      "category": "compound",
      "goalSupport": ["strength", "muscle", "endurance"]
    },
    {
      "id": "lunge-forward",
      "name": "Forward Lunge",
      "muscleGroups": ["Quads", "Glutes", "Hamstrings", "Calves"],
      "equipment": ["none", "dumbbells"],
      "difficulty": "beginner",
      "imageUrl": "/images/exercises/lunge-forward.jpg",
      "shortDescription": "Dynamic lower body exercise that improves balance and unilateral strength.",
      "instructions": "Stand tall with feet hip-width apart. Take a controlled step forward with your right foot. Lower your body until both knees are bent at approximately 90-degree angles, with your back knee hovering just above the floor. Push through your right heel to return to the starting position. Repeat on the other side.",
      "tips": [
        "Keep your upper body straight and shoulders back",
        "Step far enough forward so your front knee stays behind your toes",
        "Keep your weight centered between both legs",
        "Add dumbbells for increased difficulty"
      ],
      "suggestedWeight": "Body weight or light dumbbells",
      "defaultSets": 3,
      "defaultReps": 10,
      "restPeriod": 45,
      "category": "compound",
      "goalSupport": ["strength", "muscle", "weight-loss", "endurance"]
    },
    {
      "id": "plank-standard",
      "name": "Standard Plank",
      "muscleGroups": ["Core", "Shoulders", "Back"],
      "equipment": ["none"],
      "difficulty": "beginner",
      "imageUrl": "/images/exercises/plank-standard.jpg",
      "shortDescription": "Isometric core exercise that builds total body stability and strength.",
      "instructions": "Begin in a push-up position, then bend your elbows and rest your weight on your forearms. Your body should form a straight line from your head to your feet. Engage your core by pulling your belly button toward your spine. Hold this position for the prescribed time.",
      "tips": [
        "Don't let your hips sag or pike up",
        "Look at a spot on the floor to keep your neck neutral",
        "Breathe normally throughout the hold",
        "Squeeze your glutes for additional stability"
      ],
      "suggestedWeight": "Body weight",
      "defaultSets": 3,
      "defaultReps": 30,
      "restPeriod": 45,
      "category": "isometric",
      "goalSupport": ["strength", "endurance", "core"]
    },
    {
      "id": "dumbbell-row",
      "name": "Single-Arm Dumbbell Row",
      "muscleGroups": ["Back", "Biceps", "Shoulders"],
      "equipment": ["dumbbells", "bench"],
      "difficulty": "beginner",
      "imageUrl": "/images/exercises/dumbbell-row.jpg",
      "shortDescription": "Unilateral back exercise that builds pulling strength and corrects imbalances.",
      "instructions": "Place your right knee and hand on a bench, with your left foot on the floor. Hold a dumbbell in your left hand with arm fully extended. Pull the dumbbell up to your side while keeping your elbow close to your body. Lower the weight back down with control. Complete all reps on one side before switching.",
      "tips": [
        "Keep your back flat and parallel to the floor",
        "Pull the weight toward your hip pocket",
        "Avoid rotating your torso during the movement",
        "Focus on squeezing your shoulder blade at the top"
      ],
      "suggestedWeight": "10-25 lbs depending on experience",
      "defaultSets": 3,
      "defaultReps": 12,
      "restPeriod": 60,
      "category": "isolation",
      "goalSupport": ["strength", "muscle"]
    },
    {
      "id": "bicycle-crunch",
      "name": "Bicycle Crunch",
      "muscleGroups": ["Core", "Obliques", "Hip Flexors"],
      "equipment": ["none"],
      "difficulty": "beginner",
      "imageUrl": "/images/exercises/bicycle-crunch.jpg",
      "shortDescription": "Dynamic core exercise that targets all abdominal muscles, especially obliques.",
      "instructions": "Lie on your back with hands behind your head and legs raised with knees bent at 90 degrees. Bring your right elbow toward your left knee while extending your right leg. Then switch sides, bringing your left elbow to your right knee while extending your left leg. Continue alternating in a pedaling motion.",
      "tips": [
        "Focus on the rotation and engagement of your core",
        "Keep your elbows wide and avoid pulling on your neck",
        "Move with control rather than speed",
        "Keep your lower back pressed into the floor"
      ],
      "suggestedWeight": "Body weight",
      "defaultSets": 3,
      "defaultReps": 20,
      "restPeriod": 45,
      "category": "core",
      "goalSupport": ["core", "weight-loss", "endurance"]
    },
    {
      "id": "deadlift-barbell",
      "name": "Barbell Deadlift",
      "muscleGroups": ["Hamstrings", "Glutes", "Lower Back", "Traps"],
      "equipment": ["barbell"],
      "difficulty": "intermediate",
      "imageUrl": "/images/exercises/deadlift-barbell.jpg",
      "shortDescription": "Fundamental compound exercise that builds total-body strength and power.",
      "instructions": "Stand with feet hip-width apart and barbell over mid-foot. Bend at hips and knees to grip the bar with hands just outside your legs. With chest up and back flat, push through your heels to stand up tall, keeping the bar close to your body. Return the weight to the ground with control by hinging at the hips and bending the knees.",
      "tips": [
        "Keep your back straight throughout the movement",
        "Drive through your heels and squeeze your glutes at the top",
        "Keep the bar close to your body during the entire movement",
        "Start with lighter weight to master proper form"
      ],
      "suggestedWeight": "Varies by experience (45-225+ lbs)",
      "defaultSets": 4,
      "defaultReps": 8,
      "restPeriod": 90,
      "category": "compound",
      "goalSupport": ["strength", "muscle", "power"]
    },
    {
      "id": "bench-press-barbell",
      "name": "Barbell Bench Press",
      "muscleGroups": ["Chest", "Triceps", "Shoulders"],
      "equipment": ["barbell", "bench"],
      "difficulty": "intermediate",
      "imageUrl": "/images/exercises/bench-press-barbell.jpg",
      "shortDescription": "Classic upper body pushing exercise for building chest and pushing strength.",
      "instructions": "Lie flat on a bench with feet firmly on the ground. Grip the barbell with hands slightly wider than shoulder-width apart. Unrack the bar and lower it with control to mid-chest. Press the bar back up to full arm extension above your chest.",
      "tips": [
        "Keep your wrists straight and elbows at roughly 45-degree angles",
        "Plant your feet firmly on the ground for stability",
        "Maintain contact between your shoulders, back, and glutes with the bench",
        "Consider using a spotter for heavier weights"
      ],
      "suggestedWeight": "Varies by experience (45-225+ lbs)",
      "defaultSets": 4,
      "defaultReps": 8,
      "restPeriod": 90,
      "category": "compound",
      "goalSupport": ["strength", "muscle"]
    },
    {
      "id": "pull-up",
      "name": "Pull-Up",
      "muscleGroups": ["Back", "Biceps", "Shoulders"],
      "equipment": ["pull-up bar"],
      "difficulty": "intermediate",
      "imageUrl": "/images/exercises/pull-up.jpg",
      "shortDescription": "Challenging bodyweight exercise that builds upper body pulling strength.",
      "instructions": "Hang from a pull-up bar with hands slightly wider than shoulder-width apart, palms facing away from you. Pull your body up until your chin clears the bar by squeezing your back muscles. Lower yourself with control back to the starting position with arms fully extended.",
      "tips": [
        "Engage your core throughout the movement",
        "Focus on pulling with your back muscles, not just your arms",
        "For beginners, use an assisted pull-up machine or resistance bands",
        "Avoid swinging or kipping to maintain proper form"
      ],
      "suggestedWeight": "Body weight",
      "defaultSets": 3,
      "defaultReps": 8,
      "restPeriod": 90,
      "category": "compound",
      "goalSupport": ["strength", "muscle"]
    },
    {
      "id": "shoulder-press-dumbbell",
      "name": "Dumbbell Shoulder Press",
      "muscleGroups": ["Shoulders", "Triceps", "Upper Chest"],
      "equipment": ["dumbbells"],
      "difficulty": "intermediate",
      "imageUrl": "/images/exercises/shoulder-press-dumbbell.jpg",
      "shortDescription": "Effective upper body pushing exercise that targets all three deltoid heads.",
      "instructions": "Sit on a bench with back support. Hold a dumbbell in each hand at shoulder height with palms facing forward. Press the weights upward until your arms are fully extended overhead. Lower the weights back to shoulder level with control.",
      "tips": [
        "Keep your core engaged to support your lower back",
        "Avoid arching your back during the movement",
        "Don't lock out your elbows at the top",
        "Control the weights on the way down"
      ],
      "suggestedWeight": "10-30 lbs depending on experience",
      "defaultSets": 3,
      "defaultReps": 10,
      "restPeriod": 60,
      "category": "compound",
      "goalSupport": ["strength", "muscle"]
    },
    {
      "id": "goblet-squat",
      "name": "Goblet Squat",
      "muscleGroups": ["Quads", "Glutes", "Core"],
      "equipment": ["dumbbell", "kettlebell"],
      "difficulty": "beginner",
      "imageUrl": "/images/exercises/goblet-squat.jpg",
      "shortDescription": "Weighted squat variation that promotes proper form and core engagement.",
      "instructions": "Hold a dumbbell or kettlebell close to your chest with both hands, elbows pointing down. Stand with feet slightly wider than shoulder-width apart. Keeping your chest up and back straight, squat down until your thighs are parallel to the floor or slightly lower. Push through your heels to return to the starting position.",
      "tips": [
        "Keep your chest up throughout the movement",
        "Allow your elbows to track between your knees",
        "Maintain a neutral spine position",
        "Descend as low as possible while maintaining form"
      ],
      "suggestedWeight": "15-35 lbs depending on experience",
      "defaultSets": 3,
      "defaultReps": 12,
      "restPeriod": 60,
      "category": "compound",
      "goalSupport": ["strength", "muscle", "weight-loss"]
    },
    {
      "id": "glute-bridge",
      "name": "Glute Bridge",
      "muscleGroups": ["Glutes", "Hamstrings", "Lower Back"],
      "equipment": ["none", "barbell"],
      "difficulty": "beginner",
      "imageUrl": "/images/exercises/glute-bridge.jpg",
      "shortDescription": "Excellent exercise for targeting the posterior chain and improving hip strength.",
      "instructions": "Lie on your back with knees bent and feet flat on the floor hip-width apart. Place arms at your sides with palms facing down. Push through your heels to lift your hips off the ground until your body forms a straight line from shoulders to knees. Squeeze your glutes at the top, then lower back down with control.",
      "tips": [
        "Focus on squeezing your glutes at the top of the movement",
        "Keep your core engaged to protect your lower back",
        "Avoid overextending at the top position",
        "For added challenge, place a weight on your hips"
      ],
      "suggestedWeight": "Body weight or barbell (45+ lbs)",
      "defaultSets": 3,
      "defaultReps": 15,
      "restPeriod": 45,
      "category": "isolation",
      "goalSupport": ["strength", "muscle", "rehabilitation"]
    },
    {
      "id": "russian-twist",
      "name": "Russian Twist",
      "muscleGroups": ["Obliques", "Core"],
      "equipment": ["none", "dumbbell", "medicine ball"],
      "difficulty": "beginner",
      "imageUrl": "/images/exercises/russian-twist.jpg",
      "shortDescription": "Rotational core exercise that targets the obliques and improves trunk stability.",
      "instructions": "Sit on the floor with knees bent and feet elevated slightly off the ground. Lean back slightly to engage your core. Clasp your hands together or hold a weight in front of you. Rotate your torso to the right, then to the left, touching the ground beside your hip on each side.",
      "tips": [
        "Keep your back straight and chest up",
        "For more challenge, hold a weight or elevate your feet further",
        "Move with control rather than momentum",
        "Keep your feet together throughout the movement"
      ],
      "suggestedWeight": "Body weight or 5-10 lbs",
      "defaultSets": 3,
      "defaultReps": 20,
      "restPeriod": 45,
      "category": "core",
      "goalSupport": ["core", "weight-loss"]
    },
    {
      "id": "mountain-climber",
      "name": "Mountain Climber",
      "muscleGroups": ["Core", "Shoulders", "Hip Flexors"],
      "equipment": ["none"],
      "difficulty": "beginner",
      "imageUrl": "/images/exercises/mountain-climber.jpg",
      "shortDescription": "Dynamic exercise that combines core stability with cardiovascular benefits.",
      "instructions": "Start in a high plank position with wrists directly under shoulders. Bring your right knee toward your chest, then quickly switch and bring your left knee forward while extending your right leg back. Continue alternating in a running motion, keeping your hips level and core engaged.",
      "tips": [
        "Keep your core tight and hips level throughout",
        "Move at a pace that allows you to maintain form",
        "Avoid letting your hips rise up or sag down",
        "Look slightly ahead rather than directly down"
      ],
      "suggestedWeight": "Body weight",
      "defaultSets": 3,
      "defaultReps": 30,
      "restPeriod": 30,
      "category": "cardio",
      "goalSupport": ["cardio", "core", "weight-loss", "endurance"]
    },
    {
      "id": "burpee",
      "name": "Burpee",
      "muscleGroups": ["Full Body"],
      "equipment": ["none"],
      "difficulty": "intermediate",
      "imageUrl": "/images/exercises/burpee.jpg",
      "shortDescription": "High-intensity full-body exercise that combines strength and cardio elements.",
      "instructions": "Start standing with feet shoulder-width apart. Squat down and place hands on the floor. Jump feet back into a plank position. Perform a push-up (optional). Jump feet forward to return to squat position. Explosively jump up with arms overhead. Land softly and immediately begin the next rep.",
      "tips": [
        "Scale according to fitness level - remove the push-up or jump if needed",
        "Focus on form over speed, especially when learning",
        "Land softly with bent knees to reduce impact",
        "Keep your core engaged throughout the movement"
      ],
      "suggestedWeight": "Body weight",
      "defaultSets": 3,
      "defaultReps": 10,
      "restPeriod": 60,
      "category": "cardio",
      "goalSupport": ["cardio", "weight-loss", "endurance"]
    },
    {
      "id": "dumbbell-curl",
      "name": "Dumbbell Bicep Curl",
      "muscleGroups": ["Biceps", "Forearms"],
      "equipment": ["dumbbells"],
      "difficulty": "beginner",
      "imageUrl": "/images/exercises/dumbbell-curl.jpg",
      "shortDescription": "Classic isolation exercise for building bicep size and strength.",
      "instructions": "Stand with feet shoulder-width apart, holding a dumbbell in each hand at your sides with palms facing forward. Keeping upper arms stationary, curl the weights while contracting your biceps. Continue until dumbbells are at shoulder level. Hold briefly, then lower back to starting position with control.",
      "tips": [
        "Keep your elbows close to your torso",
        "Avoid swinging your body to lift the weight",
        "Squeeze your biceps at the top of the movement",
        "Control the descent rather than letting the weights drop"
      ],
      "suggestedWeight": "10-25 lbs depending on experience",
      "defaultSets": 3,
      "defaultReps": 12,
      "restPeriod": 60,
      "category": "isolation",
      "goalSupport": ["strength", "muscle"]
    },
    {
      "id": "tricep-dip",
      "name": "Tricep Dip",
      "muscleGroups": ["Triceps", "Chest", "Shoulders"],
      "equipment": ["bench", "parallel bars"],
      "difficulty": "beginner",
      "imageUrl": "/images/exercises/tricep-dip.jpg",
      "shortDescription": "Effective bodyweight exercise for targeting the triceps and building pushing strength.",
      "instructions": "Sit on the edge of a bench with hands gripping the edge beside your hips. Slide your butt off the bench with legs extended straight or slightly bent. Lower your body by bending your elbows until they reach about 90 degrees. Push back up to the starting position by straightening your arms.",
      "tips": [
        "Keep your shoulders down and away from your ears",
        "Position your hands close to your body to target triceps",
        "Keep your back close to the bench throughout the movement",
        "For more challenge, elevate your feet on another bench"
      ],
      "suggestedWeight": "Body weight",
      "defaultSets": 3,
      "defaultReps": 12,
      "restPeriod": 60,
      "category": "compound",
      "goalSupport": ["strength", "muscle"]
    },
    {
      "id": "lateral-raise",
      "name": "Dumbbell Lateral Raise",
      "muscleGroups": ["Shoulders"],
      "equipment": ["dumbbells"],
      "difficulty": "beginner",
      "imageUrl": "/images/exercises/lateral-raise.jpg",
      "shortDescription": "Isolation exercise that targets the lateral deltoids for broader shoulders.",
      "instructions": "Stand with feet shoulder-width apart, holding dumbbells at your sides with palms facing inward. With a slight bend in your elbows, raise the weights out to the sides until arms are parallel to the floor. Pause briefly at the top, then lower the weights back to the starting position with control.",
      "tips": [
        "Keep a slight bend in your elbows throughout",
        "Raise arms to shoulder height, not higher",
        "Use lighter weights with proper form for better results",
        "Avoid shrugging your shoulders during the movement"
      ],
      "suggestedWeight": "5-15 lbs depending on experience",
      "defaultSets": 3,
      "defaultReps": 12,
      "restPeriod": 45,
      "category": "isolation",
      "goalSupport": ["muscle"]
    },
    {
      "id": "jump-squat",
      "name": "Jump Squat",
      "muscleGroups": ["Quads", "Glutes", "Calves"],
      "equipment": ["none"],
      "difficulty": "intermediate",
      "imageUrl": "/images/exercises/jump-squat.jpg",
      "shortDescription": "Explosive lower body exercise that builds power and athleticism.",
      "instructions": "Stand with feet shoulder-width apart. Lower into a squat position with thighs parallel to the ground. Explosively jump upward as high as possible, extending through hips, knees, and ankles. Land softly by bending at the knees and immediately descend into the next squat.",
      "tips": [
        "Land softly on the balls of your feet, then heels",
        "Use your arms to help propel you upward",
        "Ensure proper squat form before adding the jump",
        "Bend knees deeply when landing to absorb impact"
      ],
      "suggestedWeight": "Body weight",
      "defaultSets": 3,
      "defaultReps": 12,
      "restPeriod": 60,
      "category": "plyometric",
      "goalSupport": ["power", "cardio", "weight-loss"]
    },
    {
      "id": "high-knees",
      "name": "High Knees",
      "muscleGroups": ["Quads", "Hip Flexors", "Core"],
      "equipment": ["none"],
      "difficulty": "beginner",
      "imageUrl": "/images/exercises/high-knees.jpg",
      "shortDescription": "Dynamic cardio exercise that improves coordination and elevates heart rate.",
      "instructions": "Stand with feet hip-width apart. Run in place, lifting your knees as high as possible - ideally to hip level. Swing your arms in opposition to your legs. Maintain a quick pace while keeping your core engaged and posture upright.",
      "tips": [
        "Focus on height rather than speed when starting",
        "Land lightly on the balls of your feet",
        "Keep your core engaged and back straight",
        "Pump your arms to increase intensity"
      ],
      "suggestedWeight": "Body weight",
      "defaultSets": 3,
      "defaultReps": 30,
      "restPeriod": 30,
      "category": "cardio",
      "goalSupport": ["cardio", "endurance", "weight-loss"]
    },
    {
      "id": "plank-side",
      "name": "Side Plank",
      "muscleGroups": ["Obliques", "Core", "Shoulders"],
      "equipment": ["none"],
      "difficulty": "beginner",
      "imageUrl": "/images/exercises/plank-side.jpg",
      "shortDescription": "Isometric core exercise that targets the obliques and improves lateral stability.",
      "instructions": "Lie on your side with legs extended. Prop yourself up on your elbow with forearm flat on the floor and perpendicular to your body. Raise your hips so your body forms a straight line from head to feet. Hold this position while keeping your core engaged. Repeat on the other side.",
      "tips": [
        "Stack your feet or place top foot in front for more stability",
        "Keep your hips lifted throughout the hold",
        "Maintain a straight line from head to heels",
        "Look straight ahead to keep your neck neutral"
      ],
      "suggestedWeight": "Body weight",
      "defaultSets": 3,
      "defaultReps": 30,
      "restPeriod": 30,
      "category": "isometric",
      "goalSupport": ["core", "strength"]
    }
  ]